import React, { PureComponent,Fragment } from 'react';
import Header from '../../common/header'
import {
	HomeWrapper,
	H3,
	Item,
	Question,
  Fixed
} from './style';

import { 
  Button,
  Icon,
  Input
} from "antd";

import "./style.css";

class Home extends PureComponent {
  constructor(props){
  	super(props)
  	this.state = {
  		data:[
           {
           	"myAnswer":"111",
             "title":"社会保障实施的重要意义：",
           	"answer": ["1. 是加快经济发展和社会进步的重要保证","2. 是社会主义市场经济体制的重要支柱","3. 是顺利进行国有企业改革的基本前提和必要条件"]
           },
           {
           	"myAnswer":"",
             "title":"社会保障制度的类型有：",
           	"answer":["救助型，国家保障型，自助型，保险型，福利性"]
           },
           {
           	"myAnswer":"",
             "title":"社会保障面临的主要问题：",
           	"answer":["1. 社会保障的覆盖面问题","2. 个人账户和社会保障基金的问题","3. 就业与失业的问题","4. 城镇贫困人口的问题","5. 农村养老保障的问题","6. 社会保障的管理体制的问题"]
           },
           {
           	"myAnswer":"",
             "title":"社会保障制度的改革：",
           	"answer":["经过多年的探索与实践，以社会保险，社会福利，社会优抚，社会救助和社会互助为主要内容，多渠道筹集社会保障基金，管理服务逐步社会化的社会保障制度已初步建立起来。1998年以来，我国实行两个确保措施：一是确保国有企业下岗职工的基本生活，二是确保离职退休人员的基本生活，多社会保障制度改革的几点建议：","","1. 以社会公平为基本原则，扩大社会保障范围"
           	,"2. 以政府为主导，筹集社会保障基金","3. 以均衡发展为基础，加快农村社会保障制度的建设","4. 以依法治国为目标，加快社会保障立法进程"]
           },
           {
           	"myAnswer":"",
             "title":"社会保障的定义：",
           	"answer":["社会保障是指国家为了维护经济发展和社会稳定，通过立法和行政措施设立的，以国民收入分配和再分配的形式，保证社会成员基本生活需要的制度"]
           },
           {
           	"myAnswer":"",
             "title":"西方社会保障理论的特点：",
           	"answer":["1. 公平与效率问题始终是其研究的核心","2. 理论研究内容逐步扩大并理论化","3. 西方社会保障经济理论的研究对西方社会保障模式的演变起到了导向作用"]
           },
           {
           	"myAnswer":"",
             "title":"西方社会保障理论发展中的几个关键问题：",
           	"answer":["1. 与经济发展的问题","2. 与自由放任主义和国家干预主义的问题","3. 与福利的问题","4. 与福利改革的问题","5. 与可持续发展的问题"]
           },
           {
           	"myAnswer":"",
             "title":"马克思、恩格斯关于社会保障理论的论述：",
           	"answer":["1. 揭示了建立社会保障制度的必要性","2. 阐明了保险基金的来源","3. 阐述了社会保险的分配","4. 阐释了社会保险的功能","5. 揭露了资本主义社会保障制度的实质"]
           },
           {
           	"myAnswer":"",
             "title":"社会保障基金的概念：",
           	"answer":["社会保障基金是国家、单位和个人统筹集中建立起来的专项基金，当受益人出现生、老、病、死、失业等情况时，提供给他们一定的社会物质帮助。"]
           },
           {
           	"myAnswer":"",
             "title":"社会保障基金的作用:",
           	"answer":["1. 增强抵御风险的能力，保证社会的安定","2. 发挥保险的互济作用，增强社会凝聚力","3. 发挥基金的经济功能，促进经济发展"]
           },
           {
           	"myAnswer":"",
             "title":"社会保障基金筹集的新途径：",
           	"answer":["1. 开征社会保障税","2. 发行社会保障专项国债","3. 有偿转让部分国有土地使用权","4. 发行社会保障彩票"]
           },
           {
           	"myAnswer":"",
             "title":"社会保障基金的类型：",
           	"answer":["DB现收现付型，DC完全积累型，混合型（部分积累和名义账户）"]
           },
           {
           	"myAnswer":"",
             "title":"社会保障基金运营的建议：",
           	"answer":["1. 健全完善全国社会保障基金的法律环境","2. 壮大全国射虎保障基金的范围，建立稳定的资金来源","3. 拓宽投资渠道，开发新的投资品种","4. 重视人力资源开发","5. 探索个人账户投资运行与保值增值机制"]
           },
           {
           	"myAnswer":"",
             "title":"社会保险的定义：",
           	"answer":["社会保险是指通过立法的形式，由社会集中建立基金，以使劳动者在年老、工伤、患病、失业、生育等丧失劳动能力时，能够获得国家和社会补偿和帮助的各种制度的总称。"]
           },
          {
           	"myAnswer":"",
             "title":"社会保险的特征：",
           	"answer":["保障性，实施社会保险的根本目的","法定性，国家立法强制实施","互济性，社会共担风险","福利性，不以盈利为目的","普遍性，实施范围广"]
           },
           {
           	"myAnswer":"",
             "title":"社会保险的功能：",
           	"answer":["1. 保障劳动者的基本生活，安定社会","2. 保护劳动者的身体健康，增进劳动者的体质","3. 促进生产发展，保证经济正常运行","4. 为社会、基层服务，方便群众生活","5. 实行再分配，适当调节劳动分配，保障低收入的基本生活"]
           },
           {
           	"myAnswer":"",
             "title":"社会保险的意义：",
           	"answer":["1. 完善社会保险制度是社会稳定的重要保证","2. 完善社会保险制度有利于促进劳动制度改革","3. 完善社会保险制度有利于启动失业机制，促进社会资源优化配置"]
           },
           {
           	"myAnswer":"",
             "title":"社会保险产生的主客观条件：",
           	"answer":["主观条件：人们对社会经济环境的依赖心理的转变，人们对劳动危险及可能造成的经济收入损失的侥幸心理的转变，人们对自身利益的选着结果不同","客观条件：劳动危险的客观存在及造成经济损失的危害程度，社会经济发展是实现保险的基金基础。"]
           },
           {
           	"myAnswer":"",
             "title":"社会保险和商业保险的区别：",
           	"answer":["1. 政府行为和企业行为的差异","2. 经营管理的主体不同","3. 经营管理和实施的方式不同","4. 保险的覆盖面不同","5. 保险费负担的原则和保障水平不同","6. 保险基金筹集的方式和水平不同","7. 立法范畴的不同","8. 舆论监督的差异性"]
           },
           {
           	"myAnswer":"",
             "title":"社会保险的模式：",
           	"answer":["投保资助型，社会统筹型，全民福利型，强制储蓄型"]
           },
           {
           	"myAnswer":"",
             "title":"社会保险制度存在的主要问题",
           	"answer":["覆盖面的问题，管理体制的问题，社保基金的问题，社保法律的问题"]
           },
           {
           	"myAnswer":"",
             "title":"养老保险的定义：",
           	"answer":["养老保险是指国家和社会根据一定的法律法规，为解决劳动者在达到国家规定的解除劳动义务的劳动年龄界限，或因年老丧失劳动能力而退出劳动岗位的基本生活而建立的一种社会保险制度。"]
           },
           {
           	"myAnswer":"",
             "title":"养老保险的基本原则：",
           	"answer":["1. 享受养老保险的权利与资格条件相对应的原则","2. 保证基本生活水平的原则","3. 分享社会经济发展成果的原则"]
           },
           {
           	"myAnswer":"",
             "title":"养老保险的重要意义",
           	"answer":["1. 养老保险在社会保障体系中具有重要地位","2. 养老保险是社会中每一个人都需要的","3. 养老保险是社会运行与发展的需要","4. 实行养老保险有利于社会的安定团结、代际接替和协调发展"]
           },
           {
           	"myAnswer":"",
             "title":"我国养老保险的特点：",
           	"answer":["社会统筹和个人账户相结合的基本养老保险制度是我国在世界上首创的一种新型基本养老保险制度，该制度既吸收了传统养老保险的优点，又借鉴了个人账户模式的长处，既体现了传统意义上的社会保险的社会互济，分担风险，保障性强的特点，又强调了职工的自我保障意识和激励机制。",
              "1. 养老保险的管理方式体现了社会主义的公平原则","2. 养老保险的目标是广度不是力度","3. 在某些情况下职工有可能发生损失"
             ]
           },
           {
           	"myAnswer":"",
             "title":"社会保障的定义：",
           	"answer":["社会统筹和个人账户相结合的基本养老保险制度是我国在世界上首创的一种新型基本养老保险制度，该制度既吸收了传统养老保险的优点，又借鉴了个人账户模式的长处，既体现了传统意义上的社会保险的社会互济，分担风险，保障性强的特点，又强调了职工的自我保障意识和激励机制。","1. 养老保险的管理方式体现了社会主义的公平原则","2. 养老保险的目标是广度不是力度","3. 在某些情况下职工有可能发生损失"]
           },
           {
           	"myAnswer":"",
             "title":"失业保险的定义：",
           	"answer":["失业保险是指国家立法强制实施，通过社会统筹集中建立基金，对因失业暂时中断生活来源的劳动者提供资助的一种社会保障制度。"]
           },
           {
           	"myAnswer":"",
             "title":"失业保险资金的筹措方式：",
           	"answer":["1. 由政府、企业和个人三方承担，德国、加拿大、日本","2. 由企业和个人承担，法国、希腊","3. 由政府和企业承担，意大利、美国、冰岛","4. 由企业承担，印度尼西亚、阿根廷","5. 由政府承担，澳大利亚、新西兰、匈牙利","6. 由个人承担，前南斯拉夫"]
           },
           {
           	"myAnswer":"",
             "title":"失业保险的享受条件：",
           	"answer":["1. 失业者必须在法定的劳动年龄之内","2. 失业者必须是非自愿失业","3. 失业者必须已参加失业保险","4. 失业者必须有劳动能力和就业意愿"]
           },
           {
             "myAnswer":"",
             "title":"失业保险的适应性：",
             "answer":["1. 制度模式与时代发展相适应","2. 制度功能与转型期我国社会政治形势相适应","3. 低水平的保障与我国经济发展水平相适应"]
           },
           {
             "myAnswer":"",
             "title":"我国失业保险目前存在的主要问题：",
             "answer":["1. 对建立社会失业保险制度的紧迫性、重要性认识严重不足","2. 现行的失业保险制度的保障能力不足","3. 我国现行的失业保险制度在促进劳动者再就业方面的功能较弱","4. 现行的失业保险制度的制度缺陷"]
           },
           {
             "myAnswer":"",
             "title":"失业保险制度的制度改革：",
             "answer":["1. 促进失业保险制度的立法改革","2. 根据就业结构的变化，对处于不同结构的失业者实施不同的失业保险政策","3. 在失业保险的对象上，因按国民待遇标准，扩大失业保险范围，尽快使城乡所有劳动者在失业保险方面享受同等的待遇","4. 完善失业统计指标，建立失业预警系统","5. 重新设计失业待遇方法"]
           },
           {
             "myAnswer":"",
             "title":"失业保险基金的管理：",
             "answer":["1. 多渠道筹措基金，扩大基金来源，提高抵御风险的能力","2. 加强失业保险基金征缴，不断增强失业保险基金的承受能力","3. 实行收支两条线管理，确保失业保险基金的安全与完整","4. 规范失业保险基金的支出，防止基金流失","5. 建立与完善失业保险基金征管的基础数据体系"]
           },
           {
             "myAnswer":"",
             "title":"医疗保险的定义：",
             "answer":["医疗社会保险是指国家立法，通过强制性社会保险的原则和方法筹集医疗基金，保障人们平等的获得适当的医疗照顾的一种制度。"]
           },
           {
             "myAnswer":"",
             "title":"医疗保险的特征：",
             "answer":["1. 强制性","2. 社会共同责任和分担风险原则","3. 保障性"]
           },
           {
             "myAnswer":"",
             "title":"商业医疗保险的定义：",
             "answer":["商业医疗保险是指，由合法的保险企业承办，按照商业经营的原则经营，投保人和保险人是在遵循公平互利、协商一致的原则，资源订立保险合同，当被保险人因疾病或意外事故受到伤害所花医疗费用等经济损失，由保险人给予补偿。"]
           },
           {
             "myAnswer":"",
             "title":"补充医疗保险的定义：",
             "answer":["补充医疗保险是指在基本医疗保险的基础上，为部分收入较高的行业和单位维持较高的医疗需求而设立的医疗保险形式。"]
           },
           {
             "myAnswer":"",
             "title":"补充医疗保险的特点：",
             "answer":["1. 参保者可以选择补偿医疗保险的具体形式","2. 相对的自愿性","3. 福利性与非福利性并存","4. 保障性"]
           },
           {
             "myAnswer":"",
             "title":"医疗社会保险给付：",
             "answer":["是指当被保险人生病后，医疗保险机构按照事先规定的条件和待遇标准，向被保险人提供医疗服务，以确保被保险人能获得适当的医疗照顾。"]
           },
           {
             "myAnswer":"",
             "title":"医疗社会保险的给付原则：",
             "answer":["1. 公平原则","2. 适当原则","3. 连续性原则"]
           },
           {
             "myAnswer":"",
             "title":"医疗保险费用的支付原则：",
             "answer":["1. 应遵循效率原则，合理引导医疗行为","2. 合理配置医疗保险资源","3. 加强约束机制，合理控制医疗费用"]
           },
           {
             "myAnswer":"",
             "title":"医疗保险的特点：",
             "answer":["1. 具有普遍性，覆盖对象原则上是全体公民","2. 采用医疗给付的补偿方式，保证医疗保险基金专款专用","3. 是短期的、经常性的保险，疾病的发生是随机的、突发性的","4. 涉及面广、更具复杂性，不仅与国家的经济发展有关，还涉及到医疗保健服务的需求与供给。"]
           },
           {
             "myAnswer":"",
             "title":"医疗保险的性质与功能：",
             "answer":["1. 公益性与福利性，不以赚钱为目的","2. 普遍性，实施范围广","3. 强制性，通过医疗保险立法强制实施","4. 风险互济和社会公平性，风险不是同时发生的，进行风险调剂"]
           },
           {
             "myAnswer":"",
             "title":"医疗保险制度的改革：",
             "answer":["1988年12月国务院下发的第44号文件既《国务院关于建立城镇职工基本医疗保险制度的决定》，进一步在全国范围内进行城镇基本医疗制度的改革，经过多年的探索与实践，以初步建立起社会统筹和个人账户相结合的基本医疗保险制度。覆盖城镇全体劳动者。","存在的问题：","1. 医疗保险覆盖率减少，个人支付医疗费用的比例不断上升","2. 药价虚高，以药养医的问题仍未得到有效遏制，使得看病贵看病难的问题十分突出","3. 我国特别是农村医疗卫生投入严重不足","4. 制度的某些规定存在漏洞","5. 医疗保险市场不公平现象严重","6. 医疗资源结构设计不科学","存在问题的原因：","1. 市场失灵","2. 目的与手段的矛盾","3. 利益的驱动","4. 市场主体单一，缺乏公平竞争","5. 农村卫生财政体制的束缚","改革方向：","1. 强化政府的宏观调控职能，纠正市场失灵","2. 加快推进医疗机构改革，促进适应医疗机构发展","3. 推行全民医疗保障","4. 政府加大对医疗卫生的投入","5. 尽快完善新型农村合作医疗制度"
           ]
           },
           {
             "myAnswer":"",
             "title":"工伤保险的定义：",
             "answer":["工伤保险是指国家和社会通过立法强制实施的，为在生产中、工作中遭受意外事故或职业病伤害的劳动者及其家属提供医疗服务，生活保障，经济补偿等物质帮助的制度。"]
           },
           {
             "myAnswer":"",
             "title":"工伤保险的功能：",
             "answer":[
             "1. 工伤保险是社会保障体系中的一个组成部分，是国家和社会通过立法强制实施的，是国家对劳动者履行的责任，也是劳动者应该享受的基本权利",
             "2. 工伤保险在一定程度上解除了职工及其家属的后顾之忧，体现了国家和社会对劳动者的尊重，有利于提高他们的工作积极性",
             "3. 有利于促进安全生产，保护和发展生产力",
             "4. 保障了受伤职工的基本权益，有利于妥善处理事故和恢复生产，维护生产的生产生活秩序，维护社会安定。"
             ]
           },
           {
             "myAnswer":"",
             "title":"补偿不究过失原则：",
             "answer":["补偿不究过失原则是指无论造成工伤的原因是劳动者一方还是雇主一方，工伤伤害的补偿均由雇主依法赔偿。"]
           },
           {
             "myAnswer":"",
             "title":"差别费率原则：",
             "answer":["差别费率原则是指在工伤保险基金的提出过程中，按照生产单位的不同分别确定不同的基金提取率。"]
           },
           {
             "myAnswer":"",
             "title":"完整补偿原则：",
             "answer":["完整补偿原则是指对被伤害的劳动者给予的补偿额应该充分完整，达到劳动者因伤所造成的直接经济损失标准。"]
           },
           {
             "myAnswer":"",
             "title":"工伤保险改革的主要成效：",
             "answer":["1. 扩大的工伤保险覆盖面，提高了工伤保险待遇","2. 统一规定的工伤政策和标准","3. 工伤保险费用全国统筹","4. 初步建立了工伤预防机制","5. 用人单位按时缴纳保险费用","6. 扩大了工伤范围","7. 根据不同行业的危险程度制定了三档不同的费率"]
           },
           {
             "myAnswer":"",
             "title":"工伤认定：",
             "answer":["工伤认定是指根据国家有关的工伤政策、法规的规定，确定职工受伤是因工还是非因工造成的事实。"]
           },
           {
             "myAnswer":"",
             "title":"工伤预防：",
             "answer":["工伤预防是指事先预防职业事故及职业病的发生，减少事故及职业病的隐患，改善和创造有利于健康的、安全的生产环境和工作条件，保护劳动者在生产中、工作中的安全与健康。"]
           },
           {
             "myAnswer":"",
             "title":"工伤保险存在的主要问题：",
             "answer":["1. 从覆盖面上看，覆盖范围仍然不广","2. 从费率机制上看，缺乏科学完善的费率系统","3. 从补偿水平上看，出现了工伤保险费用支出过高而各项制度支出偏低的问题","4. 从基金筹集上看，尚未建立科学有效的收缴制度",
             "5. 从管理制度上看，各地区从事工伤保险的人员过少，素质上良莠不齐","6. 从职业康复和工伤预防上看，我国现行的工伤保险制度偏重于待遇的处理，对预防和康复没有做出特别的必要的要求","7. 从职业病上看，职业病的发生呈上升趋势"]
           },
           {
             "myAnswer":"",
             "title":"完善工伤保险制度的对策：",
             "answer":["1. 建立科学有效的费率机制","2. 加强工伤保险的制度管理","3. 重视职业康复工作","4. 加强工伤保险与工伤预防想结合"]
           },
           {
             "myAnswer":"",
             "title":"生育保险的含义：",
             "answer":["生育保险是指女职工因怀孕和分娩所造成的暂时丧失劳动能力，中断正常的生活来源，从社会获得物质帮助的一种社会保险制度。"]
           },
           {
             "myAnswer":"",
             "title":"生育保险的特点与意义：",
             "answer":["特点：","1. 生育保险的覆盖面仅限于女职工","2. 给付项目多","3. 标准高，生育保险具有一定的福利色彩，生育期间的经济补偿高于养老、医疗等保险","4. 生育期间的医疗项目主要以检查、咨询、保健为主",
             "5. 生育保险实行产前产后都应享有的原则","6. 无论女职工妊娠结果如何。均可以按照规定得到补偿","意义:","1. 保护女职工的身体健康和劳动力的再生产","2. 有利于延续后代，保证劳动力的连续再生产","3. 可以促进计划生育政策的贯彻实施"]
           },
           {
             "myAnswer":"",
             "title":"国外生育保险的特点：",
             "answer":["1. 生育保险与医疗保障合并立法并实施","2. 覆盖范围较广","3. 待遇标准较优厚","4. 实物给付和相关服务丰富多样"]
           },
           {
             "myAnswer":"",
             "title":"完善生育保险要注意的问题：",
             "answer":["1. 生育保险的社会统筹覆盖面还比较低","2. 生育保险基金筹资渠道单一，仍未摆脱传统的企业保险模式","3. 生育保险各地统筹差异较大","4. 生育保险基金在运作和管理中的风险较大","5. 生育保险难以实现职工利益、企业利益和国家利益的均衡"]
           },
           {
             "myAnswer":"",
             "title":"住房保障制度的含义：",
             "answer":["住房保障是指政府和单位在住房领域实施社会保障职能，对城镇居民中低收入家庭进行扶持和救助的一种住房保障政策措施的综合，为解决中低收入家庭的住房问题而设置的保障性住房供给方式。"]
           },
           {
             "myAnswer":"",
             "title":"国外住房保障对中国的启示：",
             "answer":["1. 制定相应的住房保障法规","2. 政府应作为构建住房保障体系的主体","3. 注意住房保障的层次性","4. 大力发展住房金融","5. 健全完善其他保障制度"]
           },
           {
             "myAnswer":"",
             "title":"建立和完善我国住房保障制度的建议：",
             "answer":["1. 多途径提供保障性住房，加强廉租房运作管理机制建设，完善经济适用房制度","2. 规范公积金的运作","3. 住房补贴","4. 税收减免","5. 完善住房金融体制","6. 设立专门机构对住房保障进行管理，建立和完善法律法规"]
           },
           {
             "myAnswer":"",
             "title":"福利制度的概念：",
             "answer":["我国福利制度是从狭义角度去界定的，被认为是社会保障的一部分，它是指国家和社会通过举办各种福利事业和采取各种福利措施，为社会成员提供基本生活保障并不断改善生活状况的一种社会保障制度。"]
           },
           {
             "myAnswer":"",
             "title":"社会福利的特征及意义：",
             "answer":["特征：","1. 社会福利具有普遍性，社会福利是国家和社会对全体社会成员提供的一种福利制度，任何人都有权享受","2. 社会福利具有更明显的公平性，社会福利是一种典型的国民收入再分配的方式，是对社会财富分配的必要补充","3. 社会福利的资源来源具有单向性，社会福利的资金来源于国家和社会",
             "意义：","社会福利是国家对国民收入进行分配和再分配，它使劳动者除劳动所得之外，均等的获得国家提供的各种福利设施和服务。","1. 举办社会福利，有利于满足社会成员的物质生活需求","2. 举办社会福利，有利于提升社会成员精神生活需要","3. 举办社会福利，有利于促进社会经济的发展"]
           },
           {
             "myAnswer":"",
             "title":"中国社会福利制度的改革：",
             "answer":["1. 进一步明确政府的责任和职能","社会福利的社会化或者说非政府化的方向明确","2. 将社区作为社会福利的重要载体","发挥行政机制，互助机制，志愿机制和市场机制在社区服务中的作用","3. 积极探索农村社会福利的新机制"]
           },
           {
             "myAnswer":"",
             "title":"社会优抚的定义：",
             "answer":["社会优抚制度是社会保障体系中的重要组成部分，是国家以立法的形式，通过政府行为，对社会有特殊贡献者及其家属提供的具有褒扬和优待抚恤性质的社会保障措施。"]
           },
           {
             "myAnswer":"",
             "title":"社会优抚的原则：",
             "answer":["1. 保障待遇激励性原则","2. 实行综合保障原则","3. 内外公平的原则","4. 明确责任主体的原则"]
           },
           {
             "myAnswer":"",
             "title":"社会优抚的作用：",
             "answer":["1. 优抚事业是社会运行和发展的保证","2. 优抚事业是社会经济繁荣发展的重要保证","3. 优抚事业是鼓舞士气、焕发名族精神的重要环节","4. 优抚事业具有稳定社会的作用"]
           },
           {
             "myAnswer":"",
             "title":"最低生活保障的含义：",
             "answer":["最低生活保障是指法律赋予每一个公民在不能维持最低生活水平时，由国家和社会按照法定的标准向其提供的满足最低生活需要的物质援助的社会保障。"]
           },
           {
             "myAnswer":"",
             "title":"绝对贫困",
             "answer":["绝对贫困是指基本生活没有保证，温饱没有解决，简单再生产不能维持或难以维持。"]
           },
           {
             "myAnswer":"",
             "title":"最低生活保障的原则：",
             "answer":["1. 保障最低生活需求","2. 法制化","3. 普遍性","4. 维护个人尊严"]
           },
           {
             "myAnswer":"",
             "title":"最低生活保障制度的对象：",
             "answer":["1. 三无人员，无固定收入，无劳动能力，无法定赡养人或抚养人","2. 家庭中虽有在职人员，但因赡养抚养系数高或单位经济效益差，收入降低，生活困难的居民",
             "3. 失业保险期满不能就业又符合社会救济条件的居民","4. 由于各种原因导致生活低于最低生活保障标准的其他居民"]
           },
           {
             "myAnswer":"",
             "title":"最低生活保障建立的原则：",
             "answer":["1. 全民覆盖的原则","2. 政府保障的原则","3. 最低生活保障的原则","4. 法制化原则"]
           },
           {
             "myAnswer":"",
             "title":"完善最低保障制度需要注意的问题：",
             "answer":["1. 保障标准的问题","2. 低保对象的审核问题","3. 低保资金如期到位的问题","4. 低保管理工作经费的问题","5. 破产企业增加和因城市建设导致的无地农民问题","6. 对低保制度的认识问题"]
           },
           {
             "myAnswer":"",
             "title":"建立农村最低生活保障制度的必要性：",
             "answer":["1. 党的十六大提出要在2020年把我国建设成为具有中国特色社会主义小康社会的战略，而战略的实质和关键是实现农村的全面小康","2. 可以缓解加入世贸组织对我国农产品市场的冲击和挑战","3. 有利于计划生育政策的贯彻实施，有效控制人口增长","4. 能够缓解社会经济生活中的矛盾，为社会提供安全保护","5. 有利于缩小工农差距和城乡差距"]
           },
           {
             "myAnswer":"",
             "title":"定量方法",
             "answer":["既依法确定一条最低生活保障线，凡是低于这个标准的人员，均属于保障对象。"]
           },
           {
             "myAnswer":"",
             "title":"定性方法",
             "answer":["既根据社会中已经存在的不同性质，不同致贫原因的贫困群体，分门别类地确定保障对象的范围"]
           },
           {
             "myAnswer":"",
             "title":"农村社会养老保险的定义：",
             "answer":["农村社会养老保险是指农村的非城镇户口人员通过预先支付一定的劳动所得，而在丧失劳动能力时向国家和社会取得帮助，享受养老，保障衣、食等基本生活需求的一种社会保险制度"]
           },
           {
             "myAnswer":"",
             "title":"我国农村养老保险制度存在的问题：",
             "answer":["管理制度上存在的问题","1. 制度上不稳定","2. 制度设置滞后","3. 管理制度适应范围过于分散","4. 制度保障力度太小","基金体制上存在的问题","1. 正常运行中的基金流失","2. 农村养老保险机构挤占基金"
             ,"3. 非法手段造成的金流失","运行机制上存在的问题","1. 覆盖面不广，共济性差","2. 社会统筹层次范围不统一，缺乏可转移性","3. 资金保值增值难，缺口难测算","4. 农村社会养老保险行政管理缺乏应有的指导和监督","5. 监管技术性低，监管不力"]
           },
           {
             "myAnswer":"",
             "title":"建立完善农村养老保险制度的建议：",
             "answer":["1. 完善农村养老保险的法律制度","2. 拓展农村养老保险的广度和深度","3. 建立和完善基金制度，确保保障基金保值增值","4. 加强监管力度，建立有效的监管制度"]
           },
           {
             "myAnswer":"",
             "title":"当前农村医疗保险制度存在的主要问题：",
             "answer":["1. 农村合作医疗保险资金来源不足","2. 农村卫生体制难以适应保证收入水平差距极大的农民人人享受卫生保健的要求","3. 现有的农村医疗卫生资源配置不合理，难以充分发挥效益"]
           },
           {
             "myAnswer":"",
             "title":"建立农村医疗保险制度的总体思路：",
             "answer":["1. 借鉴旧的农村合作医疗保险制度已有经验，并对其改造","2. 参照城镇职工基本医疗保险制度，建立相应保障水平的农村地区基本医疗保险制度","3. 将农村居民纳入城镇职工基本医疗保险体系，建立城乡统一的基本医疗保险制度","因此，建立新型农村医疗保险制度，必须考虑农村地区经济发展的差异性，必须考虑农村地区乡土社会的特点，必须考虑政府的财力范围"]
           },
           {
             "myAnswer":"",
             "title":"建立我国农村医疗保险制度的原则",
             "answer":["1. 国家支持的原则","2. 因地制宜的原则","3. 保重大疾病的原则","4. 循序渐进、协调一致的原则"]
           },
           {
             "myAnswer":"",
             "title":"建立适合中国农村的新型合作医疗制度",
             "answer":["1. 坚持权利与义务对等，公平与效率并存","2. 建立新型合作医疗制度必须先将进程务工人员纳入城镇职工基本医疗保险体系，减少政府对合作医疗基金的补贴面",
             "3. 建立相互制约的基金管理机制，保证基金的安全","4. 健全管理制度，加强监督，进行法制化、透明化管理","5. 建立新型农村合作医疗救助制度"]
           }
         
  		],
  		current: 0,
  		show: true,
      model:1,
      randomData:0,
      textAreaValue:""
  	}
  	this.prevous=this.prevous.bind(this);
  	this.next=this.next.bind(this);
  	this.eye=this.eye.bind(this);
    this.random=this.random.bind(this);
    this.areaChanged=this.areaChanged.bind(this);
  }	
  onChange = e => {
      this.setState({
        model: e.target.value,
      });
  };
  areaChanged= e =>{
    this.setState({
       textAreaValue:e.target.value
    })
  }
  prevous(){
  	this.setState({
  		// show:false,
      textAreaValue:"",
  		current:this.state.current-1
  	})
  }

  next(){
    this.setState({
    	// show:false,
      textAreaValue:"",
  		current:this.state.current+1
  	})
  }
  eye(){
     this.setState({
  		show:!this.state.show
  	})
  }
  random(){
     this.setState({
       textAreaValue:"",
       randomData: Math.floor(Math.random()*this.state.data.length)
     })
  }
  render() {
    const { TextArea } = Input;
    return (
      <Fragment>
        <Header model={this.state.model} onChange={this.onChange.bind(this)}/>
        <HomeWrapper>

        {
            this.state.model===1?
            this.state.data.map((item,index)=>{
              return (<Question key = {index} className={this.state.current===index?"active":"inactive"}>
               <H3> <Icon onClick={this.eye} type={this.state.show?"eye":"eye-invisible"} /> {index+1}. {item.title}</H3> 
               {
                 item.answer.map((k,v)=>{
                   return <Item key={v} className={this.state.show?"active":"inactive"}>{k}</Item>
                 })
               }
               
             </Question>
              
             )
            }):
           <Question >
               <H3><Icon onClick={this.eye} type={this.state.show?"eye":"eye-invisible"} /> {this.state.randomData+1}. {this.state.data[this.state.randomData].title} </H3> 
               {
                 this.state.data[this.state.randomData].answer.map((k,v)=>{
                   return <Item key={v} className={this.state.show?"active":"inactive"}>{k}</Item>
                 })
               }
               
          </Question>
        }
         <Fixed>
           {
             this.state.model===1?
              <div >
                <Button className={this.state.current===0?"inactive":"active"} style={{marginTop:"20px",marginRight:"20px"}} onClick={this.prevous}>上一题</Button>
                <Button className={this.state.current===this.state.data.length-1?"inactive":"active"} onClick={this.next}>下一题</Button>
              </div>
                  :
             <Button style={{marginTop:"20px"}} onClick={this.random}>下一题</Button>
           }  
           <div></div>
           <TextArea style={{width:"500px",height:"200px",marginLeft:"0px",marginTop:"10px",resize:"none",color:"black"}} value={this.state.textAreaValue} onChange={this.areaChanged}></TextArea>
         </Fixed>  
        
        </HomeWrapper>   

      </Fragment>
    );
  }
}
export default Home;