import React, { PureComponent,Fragment } from 'react';
import Header from '../../common/header'

import {
  HomeWrapper,
  H3,
  Item,
  Question,
  Prev,
  Next,
  Open,
  Close,
  Box
} from './style';

import "./style.css";

class Detail extends PureComponent {
  componentDidMount(){
  
  }
  constructor(props){
  	super(props)
  	this.state = {
  		data:[
        {
          "myAnswer":"",
          "title":"工作",
          "answer":[
            "工作是劳动的另一个层面，是人类通过社会分工而进行的、有组织的、以获得劳动报酬为目的的生产活动。"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动社会学研究方法论的基本观点",
          "answer":[
            "1. 实际观点",
            "2. 实证观点",
            "3. 整体观点",
            "4. 发展的观点"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动",
          "answer":[
            "劳动是指人类创造自身生存和发展所必需的物质财富和精神财富，有目的的生产活动和提供非物质形态的服务活动"
          ]
        },
        {
          "myAnswer":"",
          "title":"协调劳动关系三方机制",
          "answer":[
            "我国协调劳动关系三方机制是指政府劳动行政部门、雇主组织和工人组织的三方代表，按照一定的制度、规则和程序，在协调劳动关系方面所形成的组织体系和运作机制"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动保护",
          "answer":[
            "劳动保护是指国家和社会为保护劳动者在生理、经济和社会各方面的权益而采取的各项保障和维护措施的统称"
          ]
        },
        {
          "myAnswer":"",
          "title":"群体结构",
          "answer":[
            "群体结构是对群体组成秩序的研究，指群体内部各构成部分之间所确立的关系形式"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动社会化的内容",
          "answer":[
            "1. 生产资料使用的社会化",
            "2. 劳动操作过程的社会化",
            "3. 劳动成果的社会化"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动社会化的发展进程阶段",
          "answer":[
            "1. 以手工劳动为基础的简单协作阶段",
            "2. 以手工劳动为基础的工场手工业阶段",
            "3. 机器和大工业阶段",
            "4. 以微电子为主角的新的技术革命阶段"
          ]
        },
        {
          "myAnswer":"",
          "title":"人口老龄化对经济发展带来的影响",
          "answer":[
            "1. 劳动年龄人口比重下降导致劳动力的不足",
            "2. 人口老龄化会影响劳动生产率",
            "3. 人口老龄化还会导致养老经费的不断增加，从而导致消费基金的增加，使积累基金相对减少"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动群体的特征包括",
          "answer":[
            "1. 劳动群体是一种组织，即劳动力组织",
            "2. 劳动群体是一个体系或系统，是一个具有层次性的结构",
            "3. 劳动群体是一个具有自觉意识的有生命力的有机体",
            "4. 劳动群体间形成一定的组织文化，成员间在心理上、行为上互相影响，具有一套共同的社会规范、价值观念和行为方式"
          ]
        },
        {
          "myAnswer":"",
          "title":"非正式组织结构的积极功能和消极功能包括",
          "answer":[
            "1. 积极功能",
            "第一，能够减轻成员在组织中的心理压力，增加组织的稳定性",
            "第二，有助于增强社会组织的灵活性",
            "2. 消极功能",
            "第一，当非正式结构在目标、利益和规范等方面与正式结构不一致时，如果不加以合理引导，容易产生消极抵触情绪和逆反心理，破坏组织的整合力",
            "第二，影响组织的凝聚力",
            "第三，放任非正式结构的发展，还可能带来一些极端的情况，破坏组织系统的正常运行"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动纪律",
          "answer":[
            "劳动纪律是劳动群体内约束劳动者行为的一系列规章、制度、条例等"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动者社会化",
          "answer":[
            "劳动者社会化指的是社会将一个普通的社会人转变成一个能适应一定的社会和时代文化，掌握社会所需的劳动技能和必要的劳动规范，遵守劳动纪律，适应工作环境的文化，从而履行合格的劳动的过程"
          ]
        },
        {
          "myAnswer":"",
          "title":"再社会化",
          "answer":[
            "再社会化是因某些个人或团体基本社会化和继续社会化的中断或失败而进行的社会化补课"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动者的特征包括",
          "answer":[
            "1. 具有一定的劳动能力",
            "2. 处于一定的劳动岗位",
            "3. 处于劳动岗位的人，遵守一定的劳动规范",
            "4. 参与实际的劳动过程"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动者的社会化内容包括",
          "answer":[
            "1. 学习和掌握一个职业必须的知识和技能",
            "2. 了解和学习劳动规范，融入企业文化",
            "3. 适应人际关系，实现角色的转变"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动者社会化的途径包括",
          "answer":[
            "家庭教化、学校教化、社会教化、网络互动、劳动组织教化等"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动者社会化的进程包括四个阶段",
          "answer":[
            "预期社会化、初始社会化、基础社会化和继续社会化"
          ]
        },
        {
          "myAnswer":"",
          "title":"职业",
          "answer":[
            "所谓职业，指人为维持自己的生计，同时实现社会联系和实现自我而进行的持续活动方式"
          ]
        },
        {
          "myAnswer":"",
          "title":"职业生涯设计",
          "answer":[
            "职业生涯设计也叫职业规划或职业计划，指的是一个人制定职业目标，确定实现目标的手段的不断发展的过程，它是个人一生中在事业发展上的战略设想和计划安排"
          ]
        },
        {
          "myAnswer":"",
          "title":"职业生涯管理",
          "answer":[
            "职业生涯管理是指组织和个人根据组织发展和个人发展的需求，对职业生涯进行计划、发展和评估的过程，既包括个人的管理也包括组织的管理"
          ]
        },
        {
          "myAnswer":"",
          "title":"影响职业生涯的八大要素",
          "answer":[
            "健康状况、社会阶层的影响、教育、性别、年龄、负担、自我观、地理因素"
          ]
        },
        {
          "myAnswer":"",
          "title":"个人参与职业生涯管理的意义包括",
          "answer":[
            "1. 对于增强对工作环境的把握能力和对工作困难的控制能力十分重要",
            "2. 有利于个人过好职业生活，处理好职业生活和日常生活的关系",
            "3. 可以实现自身价值的不断提升和超越"
          ]
        },
        {
          "myAnswer":"",
          "title":"企业组织职业生涯管理的意义包括",
          "answer":[
            "1. 职业生涯管理是企业资源合理配置的首要问题",
            "2. 职业生涯管理能充分调动人的内在积极性，更好地实现企业组织目标"
          ]
        },
        {
          "myAnswer":"",
          "title":"职业锚的五种类型包括",
          "answer":[
            "1. 技术/职能型职业锚，这一类型的人在作出职业选择和决策时的主要精力放在自己正在干的实际技术内容或职业内容上",
            "2. 管理能力型职业锚",
            "3. 安全/稳定型职业锚",
            "4. 创造型职业锚",
            "5. 自主、独立型职业锚"
          ]
        },
        {
          "myAnswer":"",
          "title":"马克思主义学派的思想包括",
          "answer":[
            "1. 根据对资料的占有来划分社会阶层",
            "2. 马克思强调社会存在决定社会意识",
            "3. 社会结构决定人们的社会行为"
          ]
        },
        {
          "myAnswer":"",
          "title":"职业声望",
          "answer":[
            "职业声望是与财富、权利并列的相对独立的要素，是一种特殊的社会舆论，反映了特定社会历史发展时期人们对职业的社会心理评价"
          ]
        },
        {
          "myAnswer":"",
          "title":"职业分层",
          "answer":[
            "职业分层就是按照一定的标准，将劳动者所从事的职业区分为职业地位和声望不同的等级序列"
          ]
        },
        {
          "myAnswer":"",
          "title":"职业流动",
          "answer":[
            "职业流动是指劳动者为追求自身的发展，寻求自身的价值而改变工作岗位、改换职业的行为"
          ]
        },
        {
          "myAnswer":"",
          "title":"职业流动的决策程序包括",
          "answer":[
            "1. 确定职业流动目标",
            "2. 选取适合的用人单位",
            "3. 分析接受单位状况",
            "4. 分析离开原单位的可能性",
            "5. 流出与维持现状的比较",
            "6. 完成流动"
          ]
        },
        {
          "myAnswer":"",
          "title":"社会分层的意义包括",
          "answer":[
            "1. 客观描述社会成员的基本构成，有利于理解社会，反映了社会变迁的过程和内容",
            "2. 揭示社会资源配置的机制，改革开放前的社会资源配置，改革开放以来的资源配置",
            "3. 缓和社会阶级矛盾，稳定社会",
            "4. 对调整社会阶层结构提出政策建议"
          ]
        },
        {
          "myAnswer":"",
          "title":"社会青年的职业流动趋势包括",
          "answer":[
            "1. 从产业的角度看，当代青年人才主要流向于第三产业和高科技产业",
            "2. 从地域的角度看，当代青年人才主要流向经济发达地区、沿海开放城市以及国外发达国家",
            "3. 从企业的性质看，当代青年人才主要流向外资企业、私营企业"
          ]
        },
        {
          "myAnswer":"",
          "title":"对青年人才职业流动的引导包括",
          "answer":[
            "1. 要为青年就业创造良好的条件：发展第三产业，扩大就业渠道，建立培训机制，不断提高员工素质，建立激励机制，吸引人才",
            "2. 要从青年人才的客观条件出发，给他们以正确有利的引导：要引导青年人才从根本上认清自我，要给自己的职业作出定位，也就是说要具有一个明确的职业观"
          ]
        },
        {
          "myAnswer":"",
          "title":"非正式组织",
          "answer":[
            "非正式组织是指以情感、兴趣、爱好和需要为基础，以满足个体的不同需要为纽带，没有正式文件规定的、自发形成的一种开放式的社会技术系统"
          ]
        },
        {
          "myAnswer":"",
          "title":"组织的构成要素",
          "answer":[
            "组织环境、管理体系和组织文化，这三个基本要素相互结合，相互作用，共同构成一个完整的组织"
          ]
        },
        {
          "myAnswer":"",
          "title":"非正式组织的积极作用包括",
          "answer":[
            "1. 化解矛盾，提高凝聚力",
            "2. 提高劳动生产率",
            "3. 信息通道",
            "4. 维护个人自尊心"
          ]
        },
        {
          "myAnswer":"",
          "title":"非正式组织的消极作用包括",
          "answer":[
            "1. 过于活跃会干扰和影响正式组织的作用",
            "2. 若引导不当会阻碍或破坏正式组织管理目标的实现",
            "3. 信息传递快，有可能会使小道消息泛滥，成为影响稳定的因素"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动组合的类型包括",
          "answer":[
            "指令组合、任务组合、利益组合、友谊组合、委员会"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳务关系",
          "answer":[
            "劳务关系是指劳务关系的当事人依据民事法律规范为形成的关于一方向另一方提供劳务的权利与义务关系"
          ]
        },
        {
          "myAnswer":"",
          "title":"集体谈判",
          "answer":[
            "集体谈判制度是指资方和雇员代表借助谈判，旨在达成覆盖某一雇员群体的协议，以决定就业条件与待遇，协商雇佣关系的一种方法"
          ]
        },
        {
          "myAnswer":"",
          "title":"中国劳动关系调整机制的内容包括",
          "answer":[
            "1. 全面实行以劳动合同制度为主要内容的新型劳动用人制度",
            "2. 推行集体协商和集体合同制度，建立企业劳动关系自我协调机制",
            "3. 建立健全劳动争议处理制度，有效预防和处理劳动争议",
            "4. 制定和完善劳动标准，为调整劳动关系、维护职工权益提供劳动政策基准"
          ]
        },
        {
          "myAnswer":"",
          "title":"中国劳动关系调整体制改革的目标包括",
          "answer":[
            "1. 继续全面实行并巩固完善劳动合同制度",
            "2. 建立健全集体协商和集体合同制度",
            "3. 大力加强企业劳动标准的制定、修订工作",
            "4. 进一步完善劳动争议处理体制，建立健全三方性、多层次的劳动争议处理制度",
            "5. 加强劳动关系调整的法制建设"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动报酬",
          "answer":[
            "劳动报酬是指劳动者通过劳动获取其全面的满足，社会学的劳动报酬不仅包括劳动者通过劳动获得的工资、奖金和津贴，还包括劳动者通过劳动得到的其他方面的收益，特别是心理上与精神上的满足"
          ]
        },
        {
          "myAnswer":"",
          "title":"人力资本",
          "answer":[
            "人力资本是通过人力资本投资形成的， 其投资形式是多方面的，包括教育支出、保健支出、劳动力国内流动支出等，其中最主要的是教育支出"
          ]
        },
        {
          "myAnswer":"",
          "title":"制约收入分配的体制因素包括",
          "answer":[
            "1. 分配受所有制形式的制约",
            "2. 分配方式受企业经营方式的制约",
            "3. 分配受宏观调控体系的制约"
          ]
        },
        {
          "myAnswer":"",
          "title":"制约收入分配的经济因素包括",
          "answer":[
            "1. 相对落后的生产力对收入分配的影响",
            "2. 区域发展不平衡导致收入分配的不公",
            "3. 技术结构导致收入分配的不公平"
          ]
        },
        {
          "myAnswer":"",
          "title":"薪酬管理的主要内容包括",
          "answer":[
            "1. 确定薪酬管理的目标。薪酬管理的目标包括：① 建立稳定的员工队伍，吸引和留住企业或组织核心员工。② 激发员工的工作热情，创造更高的工作绩效。③ 使员工的能力不断得到开发。④ 努力实现组织目标和员工个人发展目标的协调",
            "2. 选择薪酬政策。企业或组织薪酬政策实质是企业或组织管理者对企业或组织薪酬进行管理的目标、任务、手段所做的选择和组合。",
            "3. 制定薪酬计划。制定薪酬计划要遵守的两个原则：① 与企业的管理目标相协调的原则。② 以增强企业竞争力为目的的原则",
            "4. 调整薪酬结构。主要包括对企业工资陈本在不同员工之间的分配，职务和岗位工资率的确定，员工基本工资比例的调整等。"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动争议",
          "answer":[
            "劳动争议就是劳动纠纷，是指劳动关系当事人之间因劳动权利和义务而发生的争议"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动争议调解",
          "answer":[
            "劳动争议调解是指企业的调解委员会对用人单位与劳动者的纠纷，在查清事实，分清是非，明确责任的基础上，根据法律或合同约定，推动双方互相谅解，解决争议的方式"
          ]
        },
        {
          "myAnswer":"",
          "title":"工作应着重发挥哪些作用",
          "answer":[
            "1. 工会要进一步明确自己作为职工利益代表者的角色",
            "2. 工会要发挥自己的政治优势，强调自己作为国家政权的重要支柱的重要性，积极争取党和国家对工会的重视",
            "3. 工会要适应市场化的要求，加快自身的改革和建设",
            "4. 工会要注重自身的团结和统一，市场化进程的加快，各种利益群体的迅速分化，对工会的团结和统一是一个冲击"
          ]
        },
        {
          "myAnswer":"",
          "title":"社会福利",
          "answer":[
            "社会福利是指国家和社会为立法或政策范围内的所有公民提供旨在保证一定生活水平和尽可能提高生活质量的资金和服务的一种社会保障形式"
          ]
        },
        {
          "myAnswer":"",
          "title":"社会保障的功能包括",
          "answer":[
            "1. 稳定的功能",
            "2. 调节的功能",
            "3. 补助的功能",
            "4. 促进经济和社会发展的功能"
          ]
        },
        {
          "myAnswer":"",
          "title":"救助型社会保险制度",
          "answer":[
            "救助型社会保险制度是国家通过社会保障的有关措施保证每个成员在遇到各种风险事故时予以救助，使其不陷入贫困"
          ]
        },
        {
          "myAnswer":"",
          "title":"失业保险",
          "answer":[
            "失业保险就是指根据政府法令举办的，以失业为给付条件，由国家按劳动法规定在一定期限内对失业者发放失业救济金的社会保险制度"
          ]
        },
        {
          "myAnswer":"",
          "title":"养老保险",
          "answer":[
            "养老保险是指国家通过立法对劳动者因达到规定的劳动年龄界限，按照国家规定解除劳动义务后，给他们提供一定的物质帮助以维持基本生活水平的一种社会保险制度"
          ]
        },
        {
          "myAnswer":"",
          "title":"社会保障",
          "answer":[
            "社会保障是国家依法对国民收入分配和再分配的方式对社会成员的基本生活提高安全保障的行为、机制和制度的总称"
          ]
        },
        {
          "myAnswer":"",
          "title":"我国医疗保险改革应注意什么问题",
          "answer":[
            "1. 既要保障职工的基本医疗又要充分考虑财政、企业的承受能力",
            "2. 既要加大对个人的制约力度，又要考虑个人的承受能力",
            "3. 既要下大力气做好职工的医疗保险基金的筹资工作，又要特别重视医疗保险基金的管理",
            "4. 既要加强对医疗机构的制约，又要建立合理补偿机制",
            "5. 建立医疗机构合理的补偿机制"
          ]
        },
        {
          "myAnswer":"",
          "title":"弹性就业",
          "answer":[
            "弹性就业是指不限时间、不限收入、不限场所的灵活多样的就业形式，包括非全日制就业、临时就业、派遣就业、钟点工等"
          ]
        },
        {
          "myAnswer":"",
          "title":"失业人口",
          "answer":[
            "失业人口指非农业人口，在一定年龄内，有劳动能力，无业而要求就业，并在当地就业服务机构进行了求职登记的人口"
          ]
        },
        {
          "myAnswer":"",
          "title":"失业的主要原因包括",
          "answer":[
            "1. 劳动力总量供过于求是存在大量失业的根本原因",
            "2. 体制转轨带来体制性失业的必然",
            "3. 科技进步与结构性失业",
            "4. 经济周期的影响"
          ]
        },
        {
          "myAnswer":"",
          "title":"季节性失业",
          "answer":[
            "季节性失业是指因季节变动所导致的劳动者就业岗位的丧失"
          ]
        },
        {
          "myAnswer":"",
          "title":"隐性失业",
          "answer":[
            "隐性失业是指存在于企业中的在职失业，这种失业主要是政府在计划经济时期出于需要，通过某种制度造成的"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动力转移",
          "answer":[
            "劳动力转移是指农村的劳动力由农村向城市或城镇进行的转移"
          ]
        },
        {
          "myAnswer":"",
          "title":"就业的社会功能包括",
          "answer":[
            "1. 增加社会的财富",
            "2. 社会稳定的功能",
            "3. 社会发展的功能"
          ]
        },
        {
          "myAnswer":"",
          "title":"失业",
          "answer":[
            "失业是指劳动力供给与劳动力需求在总量或结构上的失衡所形成的，具有劳动能力并有就业要求的劳动者处于没有就业岗位的状态"
          ]
        },
        {
          "myAnswer":"",
          "title":"失业的类型包括",
          "answer":[
            "1. 摩擦性失业，即使劳动力市场处于均衡状态，即在现行市场工资率下，劳动力供给与劳动力需求正好相等，也总会有一些人处于转换职业之中，或者刚进入劳动力市场，正在寻找职业，或因用工需求的随机波动引起一些人不得不暂时处在工作交换甚至职业交换状态中，这就是摩擦性失业",
            "2. 结构性失业，产业结构或产品结构调整过程中，因衰落部门的劳动者与扩展部门的工作需求不吻合而形成的失业状态",
            "3. 季节性失业，因季节变动所导致的劳动者就业岗位的丧失",
            "4. 周期性失业，有效需求不足的失业，实际上是对周期性失业的一种解释",
            "5. 隐形失业，是指存在于企业中的在职失业，这种失业主要是政府在计划经济时期出于需要，通过某种制度造成的"
          ]
        },
        {
          "myAnswer":"",
          "title":"劳动力转移的积极功能包括",
          "answer":[
            "1. 支援了吸纳地的经济建设，为当地企业提供了廉价劳动力，降低了中大型企业的劳动成本",
            "2. 方便了城市群众生活，推动了第三产业的勃兴",
            "3. 反哺了流出地经济建设和发展",
            "4. 推动了农民的第三次解放"
          ]
        },
        {
          "myAnswer":"",
          "title":"特殊劳动群体",
          "answer":[
            "特殊劳动群体是由于年龄、生理结构、技能结构等方面的特点，在社会劳动过程中，遇到特殊的社会问题并因此形成了独特行为规律的群体。主要包括妇女群体、残疾人群体、未成年人群体、老年群体和外来移民群体"
          ]
        },
        {
          "myAnswer":"",
          "title":"提高我国女性人力资本投资的对策包括",
          "answer":[
            "1. 提高女性劳动力的文化素质",
            "2. 加强女性劳动力职业培训，建立终生教育体系",
            "3. 发展高层次女性劳动力教育",
            "4. 家务劳动社会化"
          ]
        },
        {
          "myAnswer":"",
          "title":"二元经济结构",
          "answer":[
            "二元经济结构是指城市以工业为主的经济部门与农村的传统农业部门并存的经济结构"
          ]
        },
        {
          "myAnswer":"",
          "title":"二元经济结构转换的表现",
          "answer":[
            "1. 在市场机制的诱导下，农业生产不断加入现代生产要素，加快了对传统农业改造的步伐",
            "2. 工业化与城市化相互作用，城市化进程明显加快",
            "3. 农业劳动力向非农业转移的速度明显加快"
          ]
        }
      ],
  		current: 0,
  		show: true,
      model:1,
      randomData:0,
      textAreaValue:"",
      deskHeight: document.body.clientHeight,
  	}
  
    this.areaChanged=this.areaChanged.bind(this);
     this.saveRef = ref => {this.refDom = ref};


  }	
  onChange = e => {
      this.setState({
        model: e.target.value,
      });
  };
  areaChanged= e =>{
    this.setState({
       textAreaValue:e.target.value
    })
  }
  previous(){
  	this.setState({
  		// show:false,
      textAreaValue:"",
  		current:this.state.current>0?this.state.current-1:0
  	})
  }

  next(){
    this.setState({
    	// show:false,
      textAreaValue:"",
  		current:this.state.current===this.state.data.length?this.state.current:this.state.current+1
  	})
  }
  eye(){
     this.setState({
  		show:!this.state.show
  	})
  }
  random(){
     this.setState({
       textAreaValue:"",
       randomData: Math.floor(Math.random()*this.state.data.length)
     })
  }
  
  render() {
    // const { TextArea } = Input;
    // const { deskHeight } = this.state;

    return (
      <Fragment>
        <Header 
          model={this.state.model} 
          current = {this.state.current}
          show={this.state.show} 
          previous = {this.previous.bind(this)} 
          random = {this.random.bind(this)}
          next = {this.next.bind(this)}
          onChange={this.onChange.bind(this)}/>

        <HomeWrapper>
        {
            this.state.model===1?
            this.state.data.map((item,index)=>{
              return (<Question key = {index} className={this.state.current===index?"active":"inactive"}>
               <H3> 
              {index+1}. {item.title}
               </H3>
              
               {
                 item.answer.map((k,v)=>{
                   return <Item key={v} className={this.state.show?"active":"inactive"}>{k} </Item>
                 })
               }
               
             </Question>
              
             )
            }):
           <Question >
           <H3> {this.state.randomData+1}. {this.state.data[this.state.randomData].title} </H3> 
               {
                 this.state.data[this.state.randomData].answer.map((k,v)=>{
                   return <Item key={v} className={this.state.show?"active":"inactive"}>{k}</Item>
                 })
               }
               
          </Question>
        }
         {
           /*
              <div ref={this.saveRef} style={{boxSizing:"border-box",marginLeft:"40px",marginRight:"40px",marginTop:"10px",maxWidth:"600px"}} >
                          <TextArea    style={{boxSizing:"border-box",resize:"none",height: deskHeight-400}} value={this.state.textAreaValue} onChange={this.areaChanged}></TextArea>
              </div>
           */
         }
         
          
       
        </HomeWrapper>   
         <Box>
            {
              this.state.show?
              <Open onClick={this.eye.bind(this)} ></Open>
              :
              <Close onClick={this.eye.bind(this)}></Close>
            }
            {
              this.state.model===1?
              <Fragment>
                {
                  this.state.current>0?
                  <Prev onClick= {this.previous.bind(this)} ></Prev>
                  :
                  ""
                }
                
                <Next onClick= {this.next.bind(this)}></Next>
              </Fragment>
              :
              <Next onClick= {this.random.bind(this)}></Next>
            }
      
          </Box>
        
      </Fragment>
    );
  }
}
export default Detail;